html/20231125T221653--reset-changes__git.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>reset changes</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">15 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231125T221653--reset-changes__git.html">reset changes</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc8e3450">1. git clean -nd</a></li>
<li><a href="#orgbd8024b">2. git clean -fd</a></li>
<li><a href="#orgc6a2c96">3. git reset &#x2013;hard HEAD</a></li>
</ul>
</div>
</nav>
<p>
Useful to know these commands when you are on a production server for
example, not having magit or Git desktop thing.
</p>

<div id="outline-container-orgc8e3450" class="outline-2">
<h2 id="orgc8e3450"><span class="section-number-2">1.</span> git clean -nd</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-bash">git clean -nd
</pre>
</div>

<p>
This command is a dry run of the git clean command. It's used to preview what
files will be removed from the working directory. The flags used here are:
</p>

<p>
<code>-n</code>: Performs a dry run, which means it shows what files would be deleted
without actually deleting them.
</p>

<p>
<code>-d</code>: Tells Git to also remove untracked directories along with untracked
files.
</p>

<p>
Running <code>git clean -nd</code> will display a list of files and directories that are
currently untracked in the repository and would be removed if the command were
executed without the <code>-n</code> flag.
</p>
</div>
</div>

<div id="outline-container-orgbd8024b" class="outline-2">
<h2 id="orgbd8024b"><span class="section-number-2">2.</span> git clean -fd</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-bash">git clean -fd
</pre>
</div>

<p>
<code>git clean -fd</code>: This command is used to forcefully remove untracked files and
directories from the working directory. The flags used here are:
</p>

<p>
<code>-f</code>: Stands for "force" and is used to perform the clean operation without
prompting for confirmation.
</p>

<p>
<code>-d</code>: Tells Git to also remove untracked directories along with untracked
files.
</p>

<p>
Running <code>git clean -fd</code> will permanently delete all untracked files and
directories in the repository. Be cautious while using this command as it
irreversibly removes files and directories that are not tracked by Git.
</p>
</div>
</div>

<div id="outline-container-orgc6a2c96" class="outline-2">
<h2 id="orgc6a2c96"><span class="section-number-2">3.</span> git reset &#x2013;hard HEAD</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-bash">git reset --hard HEAD
</pre>
</div>

<p>
<code>git reset --hard HEAD</code>: This command resets the current branch to the state of
the HEAD commit. Here's what each part does:
</p>

<p>
git reset: Resets the current HEAD to the specified state.
</p>

<p>
<code>--hard</code>: Indicates a hard reset, which means it not only changes the HEAD to
the specified commit but also resets the index and working directory to match
that commit.
</p>

<p>
<code>HEAD</code>: Refers to the latest commit of the current branch.
</p>

<p>
Running <code>git reset --hard HEAD</code> will discard all changes in the working
directory and index, reverting them to the state of the latest commit on the
current branch. Be careful when using git reset &#x2013;hard as it can discard all
uncommitted changes irretrievably.
</p>
</div>
</div>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-git.html">git</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
